'number' + 3 + 3 // number33 -> 'number' це рядок (string) 3 та 3 додались до рядка. Конкатенація - рядок + число

null + 3 // 3 -> бо математична операція і null це 0, 0+3 = тому залишається тільки 3

5 && "qwerty" //qwerty -> оскільки і 5, і qwerty це true, а && повертає останнє true значення, то повертається qwerty

+'40' + +'2' + "hillel"; // 42hillel -> + перед 40 та 2 зробив з них числа, тому додаємо 40+2=42 та string hillel.

'10' - 5 === 6; // false -> рядок '10' стає числом, тому віднімаємо 10-5=5 Та 5 не дорівнює 6, тому результат false

true + false //1 -> оскільки true це 1, а false це 0, то 1+0 буде 1

'4px' - 3 //NaN -> рядок '4px' не може стати числом, тому при відмімані від 4px 3 дає NaN

'4' - 3 //1 -> рядок '4' став числом через - і вийшло 4-3, що буде 1

'6' + 3 ** 0; //61 -> '6' це рядок, 3 в ступені 0 буде 1 і у підсумку конкатенація

12 / '6' //2 -> ділення перетворила рядок '6' на число, потім 12 поділити на 6

'10' + (5 === 6); //10false -> '10' це рядок. Порівнюємо 5 та 6 вони не дорівнюють, тому це false. Конкатенація і вийшло 10false

null == '' // false -> null при порівняні це undefined, і це не дорівнює порожньому рядку

3 ** (9 / 3); //27 -> 9 поділити на 3 буде 3, 3 у ступені 3 буде 27

!!'false' == !!'true' //true -> рядок 'false' вважається true, бо він непорожній і подвійне заперечення до цього ж, та рядок 'true' теж залишається true. Порівнюємо true == true

0 || '0' && 1 //1 -> '0' це рядок true, 1 число теж true && повертає останнє true тобто 1. Далі 0 - це false. Виходить false || 1. || повертає перше true, тобто 1

(+null == false) < 1; //false -> +null це число 0, false перетворюється в 0, тому 0=0, це true. True<1 - оскільки true перетворюється в 1, то виходить 1<1,а це false

false && true || true //true -> значить && повертає перше false, значить false || true. Далі || повертає перше true, тобто відповідь true

false && (false || true); //false -> спочатку в дужках || повертає перше true. Далі false && true - && повертає перше false, тобто відповідь false

(+null == false) < 1 ** 5; //false -> +null це число 0, false перетворюється в 0, тому 0==0 і це true, потім 1 в ступені 5 це 1, у підсумку true<1 теж саме, що 1<1, а це false